import type { Language } from './Language'

export const languages: Language[] = [
  {
    id: 'ir',
    languageNumber: 1,
    name: 'فارسی',
    level: 'بومی',
    description: 'فرد بومی هستم، تسلط کامل دارم.',
  },
  {
    id: 'us',
    languageNumber: 2,
    name: 'انگلیسی',
    level: 'مسلط',
    description:
      'اولین زبانی که عاشقش شدم. توی ۱۱ سالگی این زبان رو شروع کردم. الان، دوزبانه (bilingual) و مسلط (fluent) هستم. سطح CEFR من حدودا بین B2 و C1 هست. لهجه‌ی من هم لهجه‌ی آمریکایی هست. کل حرفه و شغلم رو با همین زبان یاد گرفتم و روزانه برای کار ازش استفاده می‌کنم.',
  },
  {
    id: 'jp',
    languageNumber: 3,
    name: 'ژاپنی',
    level: 'تازه کار',
    description:
      'دومین زبونی که عاشقش شدم. توی ۱۹ سالگی (سال ۱۴۰۵) شروعش کردم. فعلا سطحم توی رده‌بندی JLPT حدود N5 هستش. هیچ کاربردی هم برام نداره... صرفا چون *دوست داشتم* انتخاب کردم که یادش بگیرم... (از همه‌شون هم سخت‌تره... 😂)',
  },
  {
    id: 'iq',
    languageNumber: '?',
    name: 'عربی',
    level: 'بعدا',
    description:
      'بعدا می‌خوام یاد بگیرم. برای من فارسی زبون، یادگیری‌اش راحت‌تره و همچنین به عنوان یه ایرانی و مسلمون، خیلی کاربردی برام هست.',
  },
  {
    id: 'es',
    languageNumber: '?',
    name: 'اسپانیایی',
    level: 'بعدا',
    description:
      'بعدا می‌خوام یاد بگیرم. یادگیری‌اش نسبتا راحته، و زبان جالبی به نظر میاد... کاربرد خاصی فکر نمی‌کنم برام داشته باشه...',
  },
]
